Autodesk.Revit.DB.BuiltInFailures.InfillFailures.MovedInfillToHost
Infilling element was automatically moved to keep it aligned to host.

Autodesk.Revit.DB.BuiltInFailures.InfillFailures.InsertOverlapsOrOut
Highlighted inserts overlap with other inserts or completely miss their hosts.

Autodesk.Revit.DB.BuiltInFailures.InfillFailures.InsertJoinedWall
Insert conflicts with joined Wall.

Autodesk.Revit.DB.BuiltInFailures.InfillFailures.InfillNoThicknessMultiface
Highlighted infilling element could not have thickness different from its host because it spans multiple faces.

Autodesk.Revit.DB.BuiltInFailures.InfillFailures.InfillNoThicknessCeiling
Could not change type due to highlighted infilling element. 'Basic Ceiling' infills are only compatible with 'Basic Ceiling' hosts.

Autodesk.Revit.DB.BuiltInFailures.InfillFailures.InfillNoSlopeGlazing
Could not change type due to highlighted infilling element. 'Sloped glazing' infills are not allowed.

Autodesk.Revit.DB.BuiltInFailures.InfillFailures.InfillLost
Standalone infilling Wall is separated from its insert.

Autodesk.Revit.DB.BuiltInFailures.InfillFailures.InfillDifferentPhase
Wall and instance have different phasing settings. Automatic creation of the infilling wall fails.

Autodesk.Revit.DB.BuiltInFailures.InfillFailures.InfillCannotHaveDiffThickness
This infilling element must have the same thickness as its host.

Autodesk.Revit.DB.BuiltInFailures.InfillFailures.InfillCannotChangeType
Infilling element replaced by a later phase insert must be the same type as the insert's host.

Autodesk.Revit.DB.BuiltInFailures.InfillFailures.InPlaceFamilyNotCuttingHost
Instance of in-place family is not cutting host.

Autodesk.Revit.DB.BuiltInFailures.InfillFailures.FamilyInstanceIsNotCuttingHost
Instance is not cutting host.

Autodesk.Revit.DB.BuiltInFailures.InfillFailures.CannotDeleteInfill
Can't delete infilling element without deleting its insert or host.

Autodesk.Revit.DB.BuiltInFailures.InfillFailures
Failures about Infill.